""" 插入排序 """
"""
对全部的元素,假设0号元素已有序
第一轮:从1号元素开始,从后向前比较,找到1号元素在有序序列中合适位置插入
第二轮:从2号元素开始,从后向前比较,找到2号元素在有序序列中合适位置插入
...
"""

arr = [64, 25, 12, 22, 11]


def insert_sort(arr):
    # 获取数组的长度
    n = len(arr)
    # 从第1个元素开始,逐个插入到前面已排序的序列中
    for i in range(1, n):
        # 从当前位置向前比较,找到合适的插入位置
        for j in range(i, 0, -1):
            # 如果当前元素比前一个元素小,交换位置
            if arr[j] < arr[j - 1]:
                arr[j], arr[j - 1] = arr[j - 1], arr[j]
        print(f"第{i}轮排序后的结果:{arr}")


insert_sort(arr)
