""" 找到大于等于n的最小的2的幂 """


class Solution:
    def near2power(self, n: int) -> int:
        # 找到大于等于n的最小的2的幂
        if n <= 0:
            return 1
        n -= 1  # 处理n本身就是2的幂的情况
        n |= n >> 1  # 将最高位的1扩展到右边1位
        n |= n >> 2  # 将最高位的1扩展到右边3位
        n |= n >> 4  # 将最高位的1扩展到右边7位
        n |= n >> 8  # 将最高位的1扩展到右边15位
        n |= n >> 16  # 将最高位的1扩展到右边31位
        return n + 1  # 加1得到大于等于原数的最小的2的幂


if __name__ == '__main__':
    s = Solution()
    print(s.near2power(2 ** 31 - 1))  # 在python中不用担心溢出
    # 测试：n = 2³¹ - 1 = 2147483647(32位有符号整数最大值)
    print(2147483647)
