from typing import List
from collections import deque

"""
0-1 BFS (双端队列广度优先搜索) ::: LeetCode 1368
=========================================================================
🚀 【算法模板练习】使网格图至少有一条有效路径的最小代价
#### 测试链接: https://leetcode.cn/problems/minimum-cost-to-make-at-least-one-valid-path-in-a-grid/description/
-------------------------------------------------------------------------
【描述】
给你一个 m x n 的网格图 grid . grid 中每个格子都有一个数字,对应着从该格子出发下一步走的方向.
grid[i][j] 中的数字可能为以下几种情况:
- 1 :下一步往右走，也就是你会从 grid[i][j] 走到 grid[i][j + 1]
- 2 :下一步往左走，也就是你会从 grid[i][j] 走到 grid[i][j - 1]
- 3 :下一步往下走，也就是你会从 grid[i][j] 走到 grid[i + 1][j]
- 4 :下一步往上走，也就是你会从 grid[i][j] 走到 grid[i - 1][j]

注意网格图中可能会有 无效数字 ,因为它们可能指向 grid 以外的区域.

一开始,你会从最左上角的格子 (0,0) 出发.
我们定义一条 有效路径 为从格子 (0,0) 出发，每一步都顺着数字对应方向走，最终在最右下角的格子 (m - 1, n - 1) 结束的路径.
有效路径 不需要是最短路径 .

你可以花费 cost = 1 的代价修改一个格子中的数字,但每个格子中的数字 只能修改一次 .

请你返回让网格图至少有一条有效路径的最小代价.

【输入描述】
grid: 二维整数数组,表示网格图,其中 grid[i][j] 代表该格子的方向.
gridSize: 整数，表示行数 m.
gridColSize: 整数数组，表示每一行的列数.

【输出描述】
int: 返回让网格图至少有一条有效路径的最小代价.

【示例 1】
输入: grid = [[1,1,1,1],[2,2,2,2],[1,1,1,1],[2,2,2,2]]
输出: 3
解释: 你将从点 (0, 0) 出发.
到达 (3, 3) 的路径为:
(0, 0) --> (0, 1) --> (0, 2) --> (0, 3) 花费代价 cost = 1 使方向向下 -->
(1, 3) --> (1, 2) --> (1, 1) --> (1, 0) 花费代价 cost = 1 使方向向下 -->
(2, 0) --> (2, 1) --> (2, 2) --> (2, 3) 花费代价 cost = 1 使方向向下 -->
(3, 3)
总花费为 cost = 3.
=========================================================================
"""


class Solution:
    def minCost(self, grid: List[List[int]]) -> int:
        # 0占位, 1:右, 2:左, 3:下, 4:上 (题目定义的对应关系)
        move = [[0, 0], [0, 1], [0, -1], [1, 0], [-1, 0]]
        m, n = len(grid), len(grid[0])  # 获取网格行数 m 和列数 n
        distance = [[float('inf')] * n for _ in range(m)]  # 初始化距离表,默认无穷大
        queue = deque([(0, 0)])  # 初始化双端队列,起点入队
        distance[0][0] = 0  # 起点代价初始化为 0

        while queue:  # 当队列不为空时循环
            x, y = queue.popleft()  # 取出队头节点
            if x == m - 1 and y == n - 1:  # 如果到达右下角终点
                return int(distance[x][y])  # 直接返回最小代价

            for i in range(1, 5):  # 遍历 1~4 四个方向
                nx, ny = x + move[i][0], y + move[i][1]  # 计算邻居坐标
                weight = 0 if grid[x][y] == i else 1  # 顺路代价0, 改路代价1

                # 边界检查 + 松弛操作 (距离变小才处理)
                if 0 <= nx < m and 0 <= ny < n and distance[x][y] + weight < distance[nx][ny]:
                    distance[nx][ny] = distance[x][y] + weight  # 更新最短距离
                    if weight == 0:  # 如果代价是 0 (顺路)
                        queue.appendleft((nx, ny))  # 插队到队头 (VIP通道,优先处理)
                    else:  # 如果代价是 1 (改路)
                        queue.append((nx, ny))  # 排队到队尾 (普通通道)
        return -1  # 题目保证有解,是不可能返回-1的
